/** @jsx jsx */
import { jsx, Container, Box } from "theme-ui";
import SectionHeader from "components/section-header";
import Accordion from "components/accordion/accordion";
const faqs = [
  {
    title: "Я не знаю свій рівень володіння англійською мовою. Що мені робити?",
    contents: (
      <div>
        Якщо ви не знаєте свій рівень англійської, не впадайте у відчай, існує
        кілька варіантів, як його з’ясувати. Варіант перший — пройти онлайн
        тестування. Варіант другий — звернутися до досвідченого викладача, який
        проведе онлайн тестування і максимально точно та об’єктивно оцінить ваш
        рівень володіння мовою. Після цього ви можете продовжити уроки
        англійської онлайн як з викладачем, так і самостійно, проте обравши вже
        програму з урахуванням свого рівня володіння англійською.
      </div>
    ),
  },
  {
    title: "Чому зручно займатися англійською онлайн з викладачем?",
    contents: (
      <div>
        Персональне навчання з викладачем, з повним розумінням і залученістю в
        твоє ефективне навчання протягом кожного уроку тривалістю в 50 хвилин.
        Наші викладачі, так само як і студенти, проводять уроки з дому. Тому ми
        не витрачаємо гроші на оренду приміщення та супутні витрати. Це дозволяє
        нам встановлювати ціни на курси англійської нижче, ніж у оффлайн-шкіл.
      </div>
    ),
  },
  {
    title: `Скільки коштує одне заняття?`,
    contents: (
      <div>
        Вартість заняття залежить від двох чинників: пакет навчання і викладач
        (локальним або англомовний). При покупці пакета від 50 уроків кожен з
        них буде коштувати $ 12 або $ 22 відповідно. На окремій сторінці ви
        можете подивитися інші варіанти і валюти.
      </div>
    ),
  },
  {
    title: `Що потрібно, щоб приступити до занять англійською онлайн з викладачем?`,
    contents: (
      <div>
        Залишити заявку на БЕЗКОШТОВНИЙ пробний урок, на якому методист
        розповість про нашу сучасну онлайн-школу, визначить рівень та підбере
        програму згідно з вашою метою і інтересами.
      </div>
    ),
  },
];
export default function Faq() {
  return (
    <Box as="section" id="faq" variant="section.faq">
      <Container>
        <SectionHeader
          title="Відповіді на типові запитання"
          slogan="Наша команда завжди готова вам допомогті та відповісти на будь які запитання"
        />
        <Box
          sx={{
            display: "flex",
            width: ["100%", null, null, "650px", "745px"],
            flexDirection: "column",
            mx: "auto",
            my: -4,
            mb: 10,
          }}
        >
          <Accordion items={faqs} />
        </Box>
      </Container>
    </Box>
  );
}
